; domain
(define (domain guide)
(:requirements :typing )
(:types locatable - communicating locatable - interactable moving - locatable human - moving robot - moving robot - controlled location); human - locatable robot - locatable location) 
(:predicates (at ?obj - locatable ?loc - location ) (close ?loc1 - locatable ?loc2 - locatable) (interacts ?robot - moving ?human - moving) (follows ?entity1 - moving ?entity2 - moving) (followed ?entity1))
(:action GO
      :parameters (?obj - controlled ?start - location ?destination - location ?following - moving)
      :precondition (and (at ?obj ?start) (not (at ?obj ?destination)))
      :effect (and (at ?obj ?destination) (not (at ?obj ?start)) (when (follows ?following ?obj) (at ?following ?destination)) )
)

(:action APPROACH
      :parameters (?entity1 - controlled ?entity2 - locatable ?place - location)
      :precondition (and (at ?entity1 ?place) (at ?entity2 ?place) (not (close ?entity1 ?entity2)))
      :effect (and (close ?entity1 ?entity2))
)

(:action START_INTERACTION
      :parameters (?entity1 - interactable ?entity2 - interactable )
      :precondition (and (close ?entity1 ?entity2) (not (interacts ?entity1 ?entity2)))
      :effect (and (interacts ?entity1 ?entity2))
)

(:action INIT_FOLLOW
      :parameters (?entity1 - communicating ?entity2 - communicating )
      :precondition (and (interacts ?entity1 ?entity2) (not (follows ?entity2 ?entity1)))
      :effect (and (follows ?entity2 ?entity1) (followed ?entity1))
)
(:action END_FOLLOW
      :parameters (?entity1 - communicating ?entity2 - communicating )
      :precondition (and (interacts ?entity1 ?entity2) (follows ?entity2 ?entity1) (followed ?entity1))
      :effect (and (not (follows ?entity2 ?entity1)) (not (followed ?entity1)))
)
(:action END_INTERACTION
      :parameters (?entity1 - interactable ?entity2 - interactable )
      :precondition (and (close ?entity1 ?entity2) (interacts ?entity1 ?entity2) (not (follows ?entity2 ?entity1)) (not (follows ?entity1 ?entity2)))
      :effect (not (interacts ?entity1 ?entity2))
)

)

; problem
(define (problem guideZdzisiu)
  (:domain guide)
  (:objects zdzisiu - human elektron - robot init-rob - location init-hum - location kuchnia - location )
  (:init (at elektron init-rob)
  	     (at zdzisiu init-hum)
  )
  (:goal ( and (at zdzisiu kuchnia) (not (interacts elektron zdzisiu))))
)

; plan
1. (go elektron init-rob init-hum elektron)
   deleted: (at elektron init-rob)
   added: (at elektron init-hum)
   goals met: 1 of 2
2. (approach elektron zdzisiu init-hum)
   added: (close elektron zdzisiu)
   goals met: 1 of 2
3. (start_interaction elektron zdzisiu)
   added: (interacts elektron zdzisiu)
   goals met: 0 of 2
4. (init_follow elektron zdzisiu)
   added: (follows zdzisiu elektron) (followed elektron)
   goals met: 0 of 2
5. (go elektron init-hum kuchnia zdzisiu)
   deleted: (at elektron init-hum)
   added: (at elektron kuchnia) (at zdzisiu kuchnia)
   goals met: 1 of 2
6. (end_follow elektron zdzisiu)
   deleted: (follows zdzisiu elektron) (followed elektron)
   goals met: 1 of 2
7. (end_interaction elektron zdzisiu)
   deleted: (interacts elektron zdzisiu)
   goals met: 2 of 2
